test/request-response-samples/RequestHeaders__omit_element_when_empty/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ><soap:Body><Request xmlns="http://www.example.com/v1"></Request></soap:Body></soap:Envelope>